package main

import "fmt"

func main() {
	// 1. поднять бд
	// 2. установить кобру и сделать команду запуска root которая просто выведит текст
	// 3. сделать команду migrate, которая выведет текс
	// 4. поставить бибилиотеку для миграций как в каледаре
	// 5. написать кофик файл, и распарсить его
	// 6. подлючиться к бд и выполнить миграции по созданию таблиц, черные листы, белые листы. и параметы счетчиков
	// 7. сделать команду по откату миграций
	// 8. поднять редис
	// 9. в конфиг прописать настройки редиса и подключитсья к нему
	// 10. Написать протобаф файлы на все апи методы из тз, возвращается всега true
	// 10.1 Поднять grpc сервер в root
	// 11. Описываем сущнотси
	// 12. Описываем useCase, делаем бизнес логику
	// 13. пишем тесты на бизнес логику
	// 14. Проверяем что все команды отработаны
	// 15. Пишем клиент который по grpc дергает команды

	fmt.Println("anti-bruteforce1111")
}
